In [1]:
import psycopg2
from psycopg2  import extras
from sqlalchemy import create_engine
from sqlalchemy.orm import scoped_session, sessionmaker
from sqlalchemy import Table, Column, Integer, String, MetaData, ForeignKey

DATABASE = 'postgresql'
USER = 'root'
PASSWORD = 'root'
HOST = 'postgres' # shared-networkに所属しているpostgres containerを指定できる
PORT = '5432'
DB_NAME = 'sandbox'

CONNECT_STR = '{}://{}:{}@{}:{}/{}'.format(DATABASE, USER, PASSWORD, HOST, PORT, DB_NAME)
engine = create_engine(CONNECT_STR)

conn = engine.connect()
res = conn.execute("select datname, datdba, encoding, datcollate, datctype from pg_database;")

for row in res:
    print(row)

('postgres', 10, 6, 'ja_JP.UTF-8', 'ja_JP.UTF-8')
('sandbox', 10, 6, 'ja_JP.UTF-8', 'ja_JP.UTF-8')
('template1', 10, 6, 'ja_JP.UTF-8', 'ja_JP.UTF-8')
('template0', 10, 6, 'ja_JP.UTF-8', 'ja_JP.UTF-8')

In [2]:
# create poptbl
tablename = 'x003_salaries'
q1 = "SELECT * FROM information_schema.tables WHERE table_name = '{}';".format(tablename)
res = conn.execute(q1)

q2 = """
CREATE TABLE  {} (
    name  varchar(256) NOT NULL,
    salary integer NOT NULL
);
""".format(tablename)

if sum(1 for _ in res) == 0:
    print("create")
    conn.execute(q2)
    res = conn.execute(q1)
    sum(1 for _ in res)

In [3]:
# insert data
data = (
    ('相田', 300_000),
    ('神崎', 270_000),
    ('木村', 220_000),
    ('斉藤', 290_000)
)

conn.execute("DELETE FROM {};".format(tablename))

metadata = MetaData()
tbl = Table(tablename, metadata,
            Column('name', String, primary_key=False),
            Column('salary', Integer),
           )

for i in data:
    ins = tbl.insert().values(name=i[0], salary=i[1])
    conn.execute(ins)

res = conn.execute("SELECT * FROM {};".format(tablename))
for i in res:
    print(i)

('相田', 300000)
('神崎', 270000)
('木村', 220000)
('斉藤', 290000)

期待する結果

|name|new_salary|   
|:--|:--|
|相田|270000.0|
|神崎|324000.0|
|木村|220000|
|斉藤|290000|

In [4]:
q = f"""
select
    name,
    case
    when salary >= 300000                     then salary * 0.9
    when salary >= 250000 and salary < 280000 then salary * 1.2
    else salary
    end as new_salary
from x003_salaries;
"""

print(q)

res = conn.execute(q)
for i in res:
    print(i)

select
    name,
    case
    when salary >= 300000                     then salary * 0.9
    when salary >= 250000 and salary < 280000 then salary * 1.2
    else salary
    end as new_salary
from x003_salaries;

('相田', Decimal('270000.0'))
('神崎', Decimal('324000.0'))
('木村', Decimal('220000'))
('斉藤', Decimal('290000'))

In [5]:
# update

q = f"""
update {tablename}
    set salary = case
    when salary >= 300000                     then salary * 0.9
    when salary >= 250000 and salary < 280000 then salary * 1.2
    else salary
    end;
"""

print(q)

res = conn.execute(q)

res = conn.execute("SELECT * FROM {};".format(tablename))
for i in res:
    print(i)

update x003_salaries
    set salary = case
    when salary >= 300000                     then salary * 0.9
    when salary >= 250000 and salary < 280000 then salary * 1.2
    else salary
    end;

('相田', 270000)
('神崎', 324000)
('木村', 220000)
('斉藤', 290000)